core/src/main/resources/order_template/saam_deleteHLR.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Body>
      <saamint:deleteService xmlns:saamint="http://nsn.com/npm/SoapProvisioningInterface/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
         <saamint:request>
            <saamint:service>
               <saamint:attributes>
                  <saamint:attribute xsi:type="saamint:singlevalue" saamint:name="identifier" saamint:identifying="true">
                     <saamint:value xsi:type="xsd:string" xmlns:xsd="http://www.w3.org/2001/XMLSchema">{1}</saamint:value>
                  </saamint:attribute>
                  <saamint:attribute xsi:type="saamint:singlevalue" saamint:name="MSISDN">
                     <saamint:value xsi:type="xsd:string" xmlns:xsd="http://www.w3.org/2001/XMLSchema">{0}</saamint:value>
                  </saamint:attribute>
               </saamint:attributes>
               <saamint:serviceIdentifier>
                  <saamint:serviceCode>CFS_Nthlr_NPS_ONENDS_Instance_v2</saamint:serviceCode>
               </saamint:serviceIdentifier>
            </saamint:service>
         </saamint:request>
      </saamint:deleteService>
   </soapenv:Body>
</soapenv:Envelope>